# #E2-1 두 개의 변수를 이용하여 10과 20의 합을 구하는 프로그램을 작성하시오.

# a = int(input("숫자를 입력하세요 :"))
# b = int(input("숫자를 입력하세요 :"))
# c = a + b
# print("두 수의 합: %d" %c)

# #E2-2 1번의 문제의 실행 결과를 문자열 포맷팅을 이용하여 실행 결과와 같이 출력하는 프로
# #그램을 작성하시오.(10 + 20 + = 30)

# print(str(a) + " + " + str(b) + " = " + str(c))

# #S2-1 입력받은 킬로그램(KG)을 파운드(pound)와 온스(ounce)로 환산하는 프로
# #그램을 작성하시오.

# kilogram = float(input("변환할 킬로그램(Kg)은? "))
# pound = kilogram * 2.204623
# ounce = kilogram * 35.273962

# print("------------------------------")
# print("킬로그램      파운드      온스")
# print("------------------------------")
# print("%.2f      %.2f     %.2f" %(kilogram, pound, ounce))
# print("------------------------------")

##S2-2 하이픈('-')이 포함된 휴대폰 번호를 입력받아 하이픈이 삭제된 번호를 출력
##하는 프로그램을 작성하시오.

#phonenum = str(input("하이픈(-)이 포함된 11자리의 휴대폰 번호는? "))
#print("-입력된 휴대폰 번호 : " + a)
#hp1 = phonenum[0:3]
#hp2 = phonenum[4:8]
#hp3 = phonenum[9:13]
#print("-하이픈 삭제된 휴대폰 번호 : " + hp1 + hp2 + hp3)
